import pandas as pd
import pytest


@pytest.fixture
def sample_transactions():
    return pd.DataFrame(
        [
            {
                "Дата операции": "05.09.2023 11:30:32",
                "Номер карты": "1234567890125814",
                "Сумма платежа": -1000.0,
                "Кешбэк": 10.0,
                "Категория": "Супермаркеты",
                "Описание": "Лента",
            },
            {
                "Дата операции": "06.09.2023 12:00:00",
                "Номер карты": "1234567890127512",
                "Сумма платежа": -500.0,
                "Кешбэк": 5.0,
                "Категория": "Переводы",
                "Описание": "Перевод",
            },
        ]
    )


@pytest.fixture
def sample_transactions_list():
    return [
        {
            "Дата операции": "05.09.2023 11:30:32",
            "Номер карты": "1234567890125814",
            "Сумма платежа": -1000.0,
            "Кешбэк": 10.0,
            "Категория": "Супермаркеты",
            "Описание": "Лента",
        },
        {
            "Дата операции": "06.09.2023 12:00:00",
            "Номер карты": "1234567890127512",
            "Сумма платежа": -500.0,
            "Кешбэк": 5.0,
            "Категория": "Переводы",
            "Описание": "Перевод",
        },
    ]
